Repository: JamCode/guitar-ai-coach
Catalog: swift_ios_host/Sources/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# tab_practice
source: Practice
zh_hans: 练习

# tab_mine_sheets
source: My sheets
zh_hans: 我的谱

# tab_transcribe
source: Transcribe
zh_hans: 扒歌

# tab_tools
source: Tools
zh_hans: 工具

# placeholder_practice_detail
source: Practice data loads after you open this tab for the first time.
zh_hans: 首次进入该 Tab 后才会加载练习数据。

# tools_nav_title
source: Tools
zh_hans: 工具

# section_app_support
source: App & support
zh_hans: 应用与支持

# tools_tuner_title
source: Tuner
zh_hans: 调音器

# tools_tuner_subtitle
source: Mic input and standard open-string targets
zh_hans: 麦克风拾音与标准空弦目标

# tools_fretboard_title
source: Fretboard
zh_hans: 吉他指板

# tools_fretboard_subtitle
source: Vertical board, pitch labels, pluck preview, capo
zh_hans: 竖向指板·音高标注·拨弦试听·变调夹

# tools_chord_lookup_title
source: Chord lookup
zh_hans: 和弦速查

# tools_chord_lookup_subtitle
source: Offline chord tones and common shapes
zh_hans: 离线可查构成音与常见把位

# tools_chord_chart_title
source: Common chords
zh_hans: 常用和弦

# tools_chord_chart_subtitle
source: Beginner / intermediate / advanced · local diagrams
zh_hans: 初/中/高分段·本地指法图速查

# about_version_title
source: About & version
zh_hans: 关于与版本

# support_feedback_title
source: Help & feedback
zh_hans: 帮助与反馈

# support_feedback_subtitle
source: Send email
zh_hans: 发邮件反馈

# support_privacy_title
source: Privacy policy
zh_hans: 隐私政策

# support_privacy_subtitle
source: Open the web policy
zh_hans: 查看网页版隐私说明

# alert_cannot_open_mail_title
source: Cannot open Mail
zh_hans: 无法打开邮件

# alert_cannot_open_mail_message
source: Please make sure Mail is installed and a mailbox is set up, or copy your feedback and send it another way.
zh_hans: 请确认本机已安装「邮件」并已登录邮箱账户；或复制反馈内容通过其他方式发送。

# alert_cannot_open_privacy_title
source: Cannot open privacy policy
zh_hans: 无法打开隐私政策

# alert_cannot_open_privacy_message
source: Please check your network and try again.
zh_hans: 请检查网络连接后重试。

# button_ok
source: OK
zh_hans: 知道了

# feedback_mail_subject
source: Wanle Guitar feedback (%@)
zh_hans: 玩乐吉他反馈（%@）

# feedback_mail_body
source: Please describe the issue, steps, or suggestions:
zh_hans: 请描述问题、复现步骤或建议：

# common_notice_title
source: Notice
zh_hans: 提示

# transcribe_screen_title
source: Transcribe
zh_hans: 扒歌

# transcribe_import_from_photos
source: Import from Photos
zh_hans: 从相册导入

# transcribe_import_from_files
source: Import from Files
zh_hans: 从文件导入

# transcribe_formats_hint
source: Supports mp3 / m4a / wav / aac / mp4 / mov, up to 6 minutes per file
zh_hans: 支持 mp3 / m4a / wav / aac / mp4 / mov，单文件最长 6 分钟

# transcribe_section_recent
source: Recent
zh_hans: 最近历史

# transcribe_original_key
source: Original key: %@
zh_hans: 原调：%@

# transcribe_history_title
source: Transcribe history
zh_hans: 扒歌历史

# transcribe_history_row_format
source: Original key: %@ · %@
zh_hans: 原调：%@ · %@

# transcribe_toolbar_history
source: History
zh_hans: 历史

# transcribe_step_extract_audio
source: Extracting audio
zh_hans: 提取音轨

# transcribe_step_recognize_chords
source: Recognizing chords (on device)
zh_hans: 本地识别和弦

# transcribe_step_finalize
source: Preparing result
zh_hans: 整理结果

# transcribe_playback_failed_title
source: Playback failed
zh_hans: 播放失败

# transcribe_playback_missing_file
source: The original media file is missing; playback is unavailable.
zh_hans: 原始媒体文件不存在，暂时无法播放。

# transcribe_result_title
source: Result
zh_hans: 识别结果

# transcribe_processing_title
source: Processing
zh_hans: 正在识别

# transcribe_button_cancel
source: Cancel
zh_hans: 取消

# transcribe_error_audio_read_failed
source: Could not read audio from this file. Please try another file.
zh_hans: 这个文件的音轨读取失败，请换一个文件再试

# transcribe_error_chord_unstable
source: Could not detect chords reliably. Try a clearer recording.
zh_hans: 这次没能稳定识别出和弦，换一个更清晰的文件再试试

# sheets_screen_title
source: My sheets
zh_hans: 我的谱

# sheets_button_retry
source: Retry
zh_hans: 重试

# sheets_empty_message
source: No sheets yet. Tap + to add images from Photos; name the set and they are saved on device.
zh_hans: 暂无谱子。点击右上角 + 从相册多选；起名后保存到本地。

# sheets_a11y_add_from_album
source: Add from photo library
zh_hans: 从相册添加

# sheets_list_meta_format
source: %lld pages · %@
zh_hans: %lld 页 · %@

# sheets_status_line_format
source: Status: %@
zh_hans: 状态：%@

# sheets_action_delete
source: Delete
zh_hans: 删除

# sheet_status_rawOnly
source: Not parsed
zh_hans: 仅原图

# sheet_status_draft
source: Draft
zh_hans: 草稿

# sheet_status_ready
source: Ready
zh_hans: 已就绪

# task_chord_switch_name
source: Chord changes
zh_hans: 和弦切换

# task_chord_switch_desc
source: Auto-generated groups by difficulty; three levels, key and level in the gear menu.
zh_hans: 一组和弦指法随难度自动出题；初 / 中 / 高三档，右上角可调调性与难度。

# task_rhythm_strum_name
source: Strumming
zh_hans: 节奏扫弦

# task_rhythm_strum_desc
source: Focus on steady 4/4, even down- and up-strokes.
zh_hans: 目标：稳定 4/4 节拍，下上扫衔接均匀。

# task_scale_walk_name
source: Scale warmup (crawling)
zh_hans: 爬格子热身

# task_scale_walk_desc
source: Keep volume even and reduce unwanted noise.
zh_hans: 目标：保持力度均匀，减少杂音。

# task_sheet_practice_name
source: My sheets
zh_hans: 我的谱

# task_sheet_practice_desc
source: Time spent reading or playing along with saved sheets counts toward practice.
zh_hans: 打开曲谱阅读/跟练的时间计入今日练习。

# task_interval_ear_name
source: Intervals
zh_hans: 音程识别

# task_interval_ear_desc
source: Ear training: two-note intervals, four choices.
zh_hans: 视唱练耳 · 音程四选一。

# task_ear_chord_mcq_name
source: Chord ear quiz
zh_hans: 和弦听辨

# task_ear_chord_mcq_desc
source: Ear training: major, minor, and dominant 7th listening.
zh_hans: 视唱练耳 · 和弦性质听辨。

# task_ear_progression_mcq_name
source: Chord progressions
zh_hans: 和弦进行

# task_ear_progression_mcq_desc
source: Ear training: cadence listening.
zh_hans: 视唱练耳 · 和弦进行听辨。

# task_sight_singing_name
source: Sightsinging
zh_hans: 视唱训练

# task_sight_singing_desc
source: Sightsinging with immediate questions; set range in settings.
zh_hans: 视唱练耳 · 跟唱/模唱。

# task_ear_mcq_sight_subtitle
source: Start now · set range in gear · auto-saved
zh_hans: 立刻出题 · 齿轮内调音域与模式 · 设置自动保存

# practice_screen_title
source: Practice
zh_hans: 练习

# practice_retry
source: Retry
zh_hans: 重试

# practice_section_ear
source: Ear training
zh_hans: 视唱练耳

# practice_section_guitar
source: Guitar
zh_hans: 练琴

# practice_a11y_training_calendar
source: Training calendar
zh_hans: 训练日历

# practice_today_recommend
source: Today’s plan
zh_hans: 今日推荐训练

# practice_today_recommend_empty
source: No plan yet. Start a training session to generate one.
zh_hans: 暂无推荐，点击开始训练后将自动生成。

# practice_start_training
source: Start
zh_hans: 开始训练

# practice_all_training
source: All programs
zh_hans: 全部训练项目

# practice_ear_hub_subtitle
source: Pick a program; about 10 minutes per session is a good start.
zh_hans: 选择一个训练开始，建议每次 10 分钟。

# practice_guitar_hub_subtitle
source: Start with basics; keep a steady beat.
zh_hans: 从基础练习开始，优先保持节拍稳定。

# practice_nav_ear_full
source: Ear & pitch
zh_hans: 视唱练耳

# practice_nav_guitar_hub
source: Guitar practice
zh_hans: 练琴

# practice_catalog_title
source: All training programs
zh_hans: 全部训练项目

# practice_catalog_ear
source: Ear training
zh_hans: 视唱练耳

# practice_catalog_guitar
source: Guitar
zh_hans: 练琴

# time_minutes
source: %lld min
zh_hans: %lld 分钟

# time_hours_minutes
source: %lld h %lld min
zh_hans: %lld 小时 %lld 分钟

# time_hours_only
source: %lld h
zh_hans: %lld 小时

# practice_rolling_format
source: Last 7 days · %lld sessions · %@ total
zh_hans: 近7天 · %lld次 · 共%@

# practice_last_never
source: No sessions yet
zh_hans: 还没有练习记录

# practice_last_today
source: Last session: today at %@
zh_hans: 上次练习：今天 %@

# practice_last_past
source: Last session: %@
zh_hans: 上次练习：%@

# practice_error_load
source: Could not read practice data: %@
zh_hans: 读取本地练习记录失败：%@

# practice_task_migrating
source: This task is not ready: %@
zh_hans: 该任务正在迁移：%@

# practice_calendar_title
source: Calendar
zh_hans: 训练日历

# practice_pick_date
source: Choose date
zh_hans: 选择日期

# practice_month_stats
source: You trained on %lld days this month
zh_hans: 本月有 %lld 天完成了训练

# practice_today_log
source: That day
zh_hans: 当天记录

# practice_no_sessions_day
source: No records for that day
zh_hans: 所选日期暂无训练记录。

# practice_session_line
source: %@ · Difficulty %d/5
zh_hans: %@ · 难度 %d/5

# practice_duration_label
source: Duration %@
zh_hans: 训练时长 %@

# sheets_toast_save_failed
source: Save failed: %@
zh_hans: 保存失败：%@

# sheets_toast_delete_failed
source: Delete failed: %@
zh_hans: 删除失败：%@

# sheets_draft_name_placeholder
source: Sheet name
zh_hans: 输入谱名

# sheets_draft_page_count
source: %lld pages
zh_hans: 共 %lld 页

# sheets_draft_title
source: Save sheet
zh_hans: 保存谱子

# sheets_draft_cancel
source: Cancel
zh_hans: 取消

# sheets_draft_save
source: Save
zh_hans: 保存

# sheets_untitled
source: Untitled
zh_hans: 未命名谱子

# sheets_no_images
source: No sheet images
zh_hans: 未找到谱面图片

# sheets_a11y_toggle_chrome
source: Toggle title bar
zh_hans: 轻点以显示或隐藏标题栏

# sheets_page_indicator
source: Page %lld of %lld
zh_hans: 第 %lld 页 · 共 %lld 页

# sheets_practice_note_format
source: Sheet: %@ (%lld pages)
zh_hans: 曲谱：%@（%lld 页）

# onnx_spectrum_unavailable
source: This device can’t set up the audio spectrum analyzer
zh_hans: 当前设备无法初始化音频频谱分析器

# chord_practice_not_found
source: No diagram
zh_hans: 无本地指法

# rec_mod_scale_training
source: Scale practice
zh_hans: 音阶训练

# rec_mod_traditional_crawl
source: Crawl exercises
zh_hans: 传统爬格子

# rec_diff_beginner
source: beginner
zh_hans: 初级

# rec_diff_intermediate
source: intermediate
zh_hans: 中级

# rec_diff_advanced
source: advanced
zh_hans: 高级

# rec_reason_few_samples
source: Fewer than 3 sessions in the last 7 days; starting at beginner level.
zh_hans: 最近 7 天样本不足 3 次，默认从初级开始。

# rec_reason_enough
source: In the last 7 days: %lld related sessions. Recommended: %@.
zh_hans: 最近 7 天共 %lld 次相关训练，按完成率与稳定性推荐为%@。

# practice_link_interval_sub
source: Two notes ascending, four choices
zh_hans: 两音上行、四选一

# practice_link_ear_chord_sub
source: Major, minor, dominant 7th · offline bank · guitar samples
zh_hans: 大三 / 小三 / 属七 · 题库离线 · 吉他采样合成

# practice_link_ear_prog_sub
source: Common progressions · unlimited · fingerings
zh_hans: 常见流行进行 · 不限题量 · 指法揭示

# practice_task_line
source: %lld min · %@
zh_hans: %lld 分钟 · %@

# practice_row_time_diff
source: %@ · Difficulty %d/5
zh_hans: %@ · 难度 %d/5

# practice_row_duration
source: Length %@
zh_hans: 训练时长 %@

# sheets_privacy_notice
source: “My Sheets” keeps your music only on this device for personal practice. Nothing is uploaded to our servers, and this feature does not include sharing. You are responsible for ensuring you have the right to use the content you add. This notice is not legal advice or a copyright license.
zh_hans: 「我的谱」仅将内容保存在本机，供你个人练琴与读谱；不会上传至我们的服务器，也不提供分享。请确保你对所保存的谱面享有合法使用权。本说明不构成法律意见或版权许可。

# transcribe_privacy_notice
source: Audio you import is processed and stored only on this device. It is not uploaded to our servers, and this feature does not include sharing. Recognition runs on-device. You are responsible for ensuring you have the right to use the audio. This notice is not legal advice.
zh_hans: 「扒歌」所导入的音频仅在设备本机处理与保存，不会上传至我们的服务器，也不提供对外分享；和弦识别在本地完成。请确保你对所使用的音频享有合法使用权。本说明不构成法律意见。

# tools_ear_title
source: Ear training
zh_hans: 练耳

# tools_ear_subtitle
source: Intervals, chords, sight-singing
zh_hans: 音程/和弦/视唱训练

# tools_crawl_title
source: Crawl exercises
zh_hans: 爬格子

# tools_crawl_subtitle
source: Four-finger cells · steps & tempo tips
zh_hans: 传统四指一格·推荐步骤与节拍建议

# tools_scale_training_title
source: Scale practice
zh_hans: 音阶训练

# tools_scale_training_subtitle
source: Major/minor/pentatonic · Mi/Sol/La shapes
zh_hans: 大调/小调/五声·Mi/Sol/La 指型·自动出题

# tools_chord_switch_title
source: Chord changes
zh_hans: 和弦切换

# tools_chord_switch_subtitle
source: Open & barre · groups & auto BPM
zh_hans: 开放/横按·分组节奏·BPM 自动组卷

# profile_nav_title
source: Profile
zh_hans: 我的

# help_diag_title
source: Diagnostic logs
zh_hans: 诊断日志

# help_diag_subtitle
source: Crash hints: on-device error text
zh_hans: 闪退排查：查看本机记录的异常

# help_faq_title
source: FAQ
zh_hans: 常见问题

# help_faq_subtitle
source: Tuner, practice, My sheets
zh_hans: 调音器、练习记录、我的谱相关问题

# help_bug_title
source: Report a bug
zh_hans: 问题反馈

# help_bug_subtitle
source: Describe steps to reproduce
zh_hans: 描述你的问题与复现步骤

# help_suggest_title
source: Feature ideas
zh_hans: 功能建议

# help_suggest_subtitle
source: Tell us what you want next
zh_hans: 告诉我们你希望新增的功能

# help_about_row_title
source: About us
zh_hans: 关于我们

# help_about_row_subtitle
source: Version & open source
zh_hans: 版本信息与开源说明

# about_kv_version
source: Version
zh_hans: 应用版本

# about_kv_channel
source: Channel
zh_hans: 发布渠道

# about_kv_platform
source: Platform
zh_hans: 系统平台

# about_copy_version
source: Copy version info
zh_hans: 复制版本信息

# about_copied_alert
source: Version info copied
zh_hans: 版本信息已复制

# privacy_local_nav_title
source: Privacy & on-device data
zh_hans: 隐私与本地数据

# privacy_mode_title
source: Current mode
zh_hans: 当前模式

# privacy_mode_subtitle
source: Offline (no sign-in, no network required)
zh_hans: 离线模式（无需登录，无网络依赖）

# privacy_storage_title
source: Where data is stored
zh_hans: 数据存储位置

# privacy_storage_subtitle
source: Practice and sheets stay in this app’s sandbox on device
zh_hans: 练习记录和曲谱仅保存在本机应用沙箱内

# privacy_sync_title
source: Cloud sync
zh_hans: 云同步

# privacy_sync_subtitle
source: Not enabled in this version
zh_hans: 当前版本未启用云端同步与账号恢复

# diag_nav_title
source: Diagnostic logs
zh_hans: 诊断日志

# diag_loading
source: Loading…
zh_hans: 加载中…

# diag_notes_title
source: Notes
zh_hans: 说明

# diag_notes_body
source: Uncaught Swift errors append to the path below. For native crashes, use Xcode device logs.
zh_hans: Swift 层未捕获异常会追加写入下方路径。原生崩溃需查看 Xcode 设备日志。

# diag_file_title
source: Log file
zh_hans: 日志文件

# diag_size_kb_format
source: About %@ KB
zh_hans: 约 %@ KB

# diag_share_preview
source: Wanle Guitar diagnostic log
zh_hans: 玩乐吉他 诊断日志

# diag_share_button
source: Share log file
zh_hans: 分享日志文件

# diag_copy_path
source: Copy path
zh_hans: 复制路径

# diag_clear_logs
source: Clear logs
zh_hans: 清空日志

# diag_clear_confirm_title
source: Clear diagnostic logs?
zh_hans: 清空诊断日志？

# diag_clear_message
source: This removes on-device error text. It can’t be undone.
zh_hans: 将删除本机已记录的错误文本（不可恢复）。

# diag_toast_path_copied
source: Path copied
zh_hans: 路径已复制

# diag_toast_cleared
source: Cleared
zh_hans: 已清空

# diag_path_unavailable
source: (Not available on this platform)
zh_hans: （未初始化或当前平台不支持）

# chord_chart_about_title
source: About this chart
zh_hans: 关于本表

# chord_chart_about_body
source: Chords are grouped by type: triads, sevenths, sus, add, extensions, and alterations. Tap a card to hear arpeggio then strum.
zh_hans: 按和弦类型分组：基础三和弦、七和弦、挂留、加音、延伸与变化和弦。点按和弦卡片试听（先分解后柱式）。

# chord_chart_fret_line_format
source: Strings 6→1: %@
zh_hans: 6→1 弦：%@

# chord_chart_a11y_label_format
source: %@ chord
zh_hans: %@ 和弦

# chord_chart_a11y_hint
source: Tap to preview: arpeggio, then strum
zh_hans: 点按试听，先分解琶音再柱式和弦

# app_product_name
source: Wanle Guitar
zh_hans: 玩乐吉他

# tuner_nav_title
source: Tuner
zh_hans: 调音器

# tuner_section_status
source: Status
zh_hans: 状态

# tuner_select_string
source: Choose a string
zh_hans: 选择弦

# tuner_howto_pick
source: Use the headstock layout: tap a button for the open-string reference, then pluck that string and watch the meter.
zh_hans: 按琴头旋钮位置选择：点弦钮会播放该弦标准参考音；再轻拨同一根弦，对照表头指针调准。

# tuner_knob_unsure
source: Not sure which peg? Pluck the string, then turn slowly and watch the dot return to center.
zh_hans: 不知道拧哪个琴钮时：先轻拨这根弦，再慢慢拧，观察红点是否回到中间。

# tuner_status_tap_string
source: Tap a string below to start
zh_hans: 轻点下方弦钮开始调音

# tuner_listening
source: Listening…
zh_hans: 监听中…

# tuner_stopped
source: Stopped
zh_hans: 已停止监听

# tuner_error_ref_fmt
source: Could not play reference: %@
zh_hans: 参考音播放失败：%@

# tuner_error_start_fmt
source: Could not start audio: %@
zh_hans: 启动音频失败：%@

# tuner_status_locked_rms
source: RMS %@ · locked pitch
zh_hans: RMS %@ · 已锁定基频

# tuner_target_pick_first
source: Target: select a string first
zh_hans: 目标：请先选择弦

# tuner_target_line_format
source: Target: string %lld · %@ Hz
zh_hans: 目标：第 %lld 弦 · %@ Hz

# tuner_state_need_title
source: Choose string
zh_hans: 先选弦

# tuner_state_need_detail
source: Pick a string button below
zh_hans: 点下方按钮选择要调的弦

# tuner_state_need_helper
source: Tap a string, then pluck it
zh_hans: 先点下面的弦号，再拨那根弦

# tuner_state_pluck_title
source: Pluck the string
zh_hans: 开始拨弦

# tuner_state_pluck_detail
source: Keep plucking; watch the dot reach center
zh_hans: 持续轻拨当前弦，观察红点是否居中

# tuner_state_pluck_helper
source: Aim for the center band
zh_hans: 只看红点是否回到中间区域

# tuner_state_intune_title
source: In tune
zh_hans: 已调准

# tuner_state_intune_detail
source: Leave the peg as-is
zh_hans: 保持当前旋钮位置即可

# tuner_state_intune_helper
source: Near the center line
zh_hans: 已在中线附近，基本完成

# tuner_state_low_title
source: Flat
zh_hans: 偏低

# tuner_state_low_detail
source: Raise the pitch a little (slowly)
zh_hans: 把音高调高一点（继续慢调）

# tuner_state_low_helper
source: Dot is left; turn tighter slowly
zh_hans: 红点在左，慢慢拧紧一点

# tuner_state_high_title
source: Sharp
zh_hans: 偏高

# tuner_state_high_detail
source: Lower the pitch a little (slowly)
zh_hans: 把音高调低一点（继续慢调）

# tuner_state_high_helper
source: Dot is right; loosen slightly
zh_hans: 红点在右，轻微放松一点

# tuner_knob_left
source: left-side pegs
zh_hans: 左侧旋钮

# tuner_knob_right
source: right-side pegs
zh_hans: 右侧旋钮

# tuner_rot_tight_fmt
source: Try (%1$@): nudge about 1/8 turn toward tighter; if the dot moves farther, reverse.
zh_hans: 操作建议（%1$@）：向拧紧方向小幅旋转约 1/8 圈；若红点离中线更远，立即反向。

# tuner_rot_loose_fmt
source: Try (%1$@): nudge about 1/8 turn looser; if the dot moves farther, reverse.
zh_hans: 操作建议（%1$@）：向放松方向小幅旋转约 1/8 圈；若红点离中线更远，立即反向。

# tuner_headstock
source: Headstock
zh_hans: 琴头

# tuner_thick_to_thin
source: Thick → thin
zh_hans: 粗 → 细

# tuner_a11y_string_format
source: String %lld, %@
zh_hans: 第 %lld 弦，%@

# tuner_pd_buffer_short
source: Buffer too short
zh_hans: 缓冲过短

# tuner_pd_no_energy
source: No energy
zh_hans: 无能量

# tuner_pd_quiet
source: Input too quiet
zh_hans: 音量过低

# tuner_pd_lag_invalid
source: Invalid lag range
zh_hans: 滞后范围无效

# tuner_pd_periodic_weak
source: Not periodic enough
zh_hans: 周期性不足

# tuner_pd_peak_weak
source: Peak not clear enough
zh_hans: 峰值不突出

# tuner_pd_freq_out
source: Out of range
zh_hans: 频率越界

# tuner_hint_1
source: Thinnest string
zh_hans: 最细弦

# tuner_hint_2
source: Second thinnest
zh_hans: 次细弦

# tuner_hint_3
source: Slightly thin (middle pair)
zh_hans: 中间偏细

# tuner_hint_4
source: Slightly thick (middle pair)
zh_hans: 中间偏粗

# tuner_hint_5
source: Second thickest
zh_hans: 次粗弦

# tuner_hint_6
source: Thickest string
zh_hans: 最粗弦

# button_cancel
source: Cancel
zh_hans: 取消

# diag_clear_action
source: Clear
zh_hans: 清空
